"{\n  \"resume\": {\n    \"company_name\": \"Lendi Group\",\n    \"name\": \"Ivan Bazhenov\",\n    \"title\": \"Software Engineer (Backend Python) | Event-driven systems | Mortgage/fintech domain exposure\",\n    \"phone\": \"0466284180\",\n    \"email\": \"bazhenov.in@gmail.com\",\n    \"address\": \"Kensington, VIC 3031 (Melbourne) - open to relocate to Sydney, NSW\",\n    \"personal_summary\": \"Software Engineer with 7+ years of backend experience building and operating scalable, low-latency microservices and web APIs in Python (FastAPI/Django). Strong background in event-driven architectures (Kafka/RabbitMQ), data-intensive systems (PostgreSQL, ClickHouse, Redis), and production support (debugging, monitoring, incident response). Experienced shipping self-testing code with CI/CD (GitLab) and improving engineering ways of working through pragmatic design, code review, and observability. Domain experience in lending workflows and credit decisioning (mortgage automation, servicing/income checks, credit scoring integrations). Onshore in Australia and available for full-time roles; requires employer sponsorship (TSS 482).\",\n    \"skills\": {\n      \"Core languages & frameworks\": [\n        \"Python 3\",\n        \"FastAPI\",\n        \"Django\",\n        \"Flask\",\n        \"AsyncIO\",\n        \"Pydantic\"\n      ],\n      \"Web APIs\": [\n        \"HTTP/REST\",\n        \"API design for internal/external consumers\",\n        \"Authentication/authorisation patterns (service-to-service)\",\n        \"API observability (structured logs, tracing headers)\"\n      ],\n      \"Messaging & event-driven systems\": [\n        \"Kafka\",\n        \"RabbitMQ\",\n        \"Asynchronous processing\",\n        \"Event logging and downstream integrations\"\n      ],\n      \"Testing & delivery\": [\n        \"pytest\",\n        \"Automated testing in legacy and greenfield codebases\",\n        \"Self-testing code practices\",\n        \"CI/CD with GitLab CI/CD\",\n        \"Code review and quality gates\"\n      ],\n      \"Data stores & analytics\": [\n        \"PostgreSQL\",\n        \"ClickHouse\",\n        \"Redis\",\n        \"Tarantool\",\n        \"SQL performance tuning\",\n        \"ETL (dbt, Spark/PySpark)\"\n      ],\n      \"Cloud, platform & operations\": [\n        \"Docker\",\n        \"Kubernetes\",\n        \"Git\",\n        \"Infrastructure automation (Ansible)\",\n        \"Terraform (foundational)\",\n        \"AWS (foundational: EC2, IAM, S3, RDS, VPC)\"\n      ],\n      \"Observability & production support\": [\n        \"Monitoring, alerting and incident response\",\n        \"OpenSearch/Elasticsearch, Kibana\",\n        \"Prometheus, Grafana\",\n        \"Jaeger, OpenTelemetry\",\n        \"Sentry\",\n        \"Health checks, metrics, dashboards\"\n      ],\n      \"Ways of working (collaboration)\": [\n        \"Cross-functional delivery with Product/UX and engineers\",\n        \"Pragmatic domain modelling and iterative design\",\n        \"Continuous improvement of team processes\"\n      ],\n      \"AI-powered tools\": [\n        \"Exposure to AI coding assistants and chat-based tooling to speed up development and troubleshooting (used for refactoring support, test scaffolding and investigation)\"\n      ]\n    },\n    \"career_history\": [\n      {\n        \"position\": \"Software Engineer (Backend, Python)\",\n        \"company\": \"A2 Code\",\n        \"location\": \"Remote\",\n        \"dates\": \"November 2024-Current\",\n        \"responsibilities\": [\n          \"Designed and implemented a security audit/event logging system and export pipeline to external security/SIEM/CEF tools, aligning event requirements with multiple teams and enabling onboarding of a major enterprise client.\",\n          \"Built batch ETL for analytical consolidation and data modelling (dbt + Apache Spark), moving data from PostgreSQL to ClickHouse to support scalable reporting and decision-making use cases.\",\n          \"Re-architected seven synchronous single-cloud adapter services into one multi-cloud service using asynchronous adapters; reduced Kubernetes footprint (pods 7 to 1), improved throughput and p95 latency, and simplified operations and support.\",\n          \"Implemented GitLab CI/CD pipelines to build, test, version and publish internal Python libraries to a private package registry (Nexus), improving release governance and developer productivity.\",\n          \"Centralised service logs into OpenSearch and strengthened production troubleshooting workflows, reducing time to isolate and remediate incidents.\"\n        ]\n      },\n      {\n        \"position\": \"Software Engineer\",\n        \"company\": \"VK\",\n        \"location\": \"Moscow, Russia\",\n        \"dates\": \"August 2023-November 2024\",\n        \"responsibilities\": [\n          \"Delivered and supported high-load microservices with a strong focus on reliability, low latency and operational excellence (PostgreSQL, Kafka, Tarantool).\",\n          \"Designed and implemented a Tarantool-based timer subsystem to replace a legacy scheduler, improving robustness and simplifying architecture under load.\",\n          \"Introduced an A/B testing framework for business-logic scenarios to ship changes safely and measure impact, supporting iterative product delivery.\",\n          \"Built an internal library for secure inter-service HTTP calls (auth, proxy, certificates) with observability hooks (trace propagation, structured logging), standardising API integrations across services.\"\n        ]\n      },\n      {\n        \"position\": \"Python Developer (Lending platform)\",\n        \"company\": \"Balance-Platform LLC\",\n        \"location\": \"Moscow, Russia\",\n        \"dates\": \"March 2020-August 2023\",\n        \"responsibilities\": [\n          \"Automated mortgage workflows using state-machine driven business processes, improving turnaround times and customer experience for key clients.\",\n          \"Delivered services to obtain pension-fund extracts and calculate borrower income within the mortgage pipeline, reducing manual verification workload for operations teams.\",\n          \"Integrated ML model outputs into a credit scoring service to enable automated use of model signals in credit decisioning and policy flows.\",\n          \"Containerised services and migrated legacy components to Kubernetes to improve deployment consistency, scalability and supportability.\"\n        ]\n      },\n      {\n        \"position\": \"Full-stack Developer (Python/JavaScript)\",\n        \"company\": \"Kefir Advertising Agency\",\n        \"location\": \"Moscow, Russia\",\n        \"dates\": \"March 2019-February 2020\",\n        \"responsibilities\": [\n          \"Built and maintained a Python Django CMS with caching, dynamic fields, and SEO-related features (including sitemap generation).\",\n          \"Implemented user-facing web features in JavaScript/jQuery and improved frontend build processes with webpack, working with stakeholders on interaction requirements.\"\n        ]\n      },\n      {\n        \"position\": \"System Administrator\",\n        \"company\": \"Alexandrovsky Park Group\",\n        \"location\": \"Moscow, Russia\",\n        \"dates\": \"May 2016-January 2019\",\n        \"responsibilities\": [\n          \"Developed Python and MS SQL automation scripts and a reporting application to reduce manual operational work and improve data accuracy.\",\n          \"Supported and maintained IT infrastructure for 100+ PCs and network services, building strong operational discipline and incident handling skills.\"\n        ]\n      },\n      {\n        \"position\": \"System Administrator\",\n        \"company\": \"Ulyanovskkurort JSC\",\n        \"location\": \"Russia\",\n        \"dates\": \"August 2011-May 2016\",\n        \"responsibilities\": [\n          \"Maintained corporate website and supported 100+ PCs and IT infrastructure, ensuring business continuity and user support.\"\n        ]\n      },\n      {\n        \"position\": \"Logistics Specialist\",\n        \"company\": \"SPSR-Express LLC\",\n        \"location\": \"Russia\",\n        \"dates\": \"August 2008-June 2010\",\n        \"responsibilities\": [\n          \"Handled warehouse logistics and provided IT support, developing a customer-focused, process-driven approach.\"\n        ]\n      }\n    ],\n    \"education\": [\n      {\n        \"institution\": \"Torrens University Australia\",\n        \"location\": \"Melbourne, VIC\",\n        \"dates\": \"Expected in December 2027\",\n        \"qualification\": \"Masters of Information Technology\"\n      },\n      {\n        \"institution\": \"ILSC Education Group\",\n        \"location\": \"Melbourne, VIC\",\n        \"dates\": \"July 2025\",\n        \"qualification\": \"ELICOS, General English\"\n      },\n      {\n        \"institution\": \"Slurm.io\",\n        \"location\": \"Online\",\n        \"dates\": \"May 2025\",\n        \"qualification\": \"Cloud Engineer AWS (basic)\"\n      },\n      {\n        \"institution\": \"Practicum By Yandex\",\n        \"location\": \"Online\",\n        \"dates\": \"February 2023\",\n        \"qualification\": \"Middle Python Developer\"\n      },\n      {\n        \"institution\": \"Stepic.org\",\n        \"location\": \"Online\",\n        \"dates\": \"December 2022\",\n        \"qualification\": \"Apache Airflow For Analysts\"\n      },\n      {\n        \"institution\": \"Slurm.io\",\n        \"location\": \"Online\",\n        \"dates\": \"March 2021\",\n        \"qualification\": \"Kubernetes for Developers\"\n      },\n      {\n        \"institution\": \"Stepic.org\",\n        \"location\": \"Online\",\n        \"dates\": \"May 2017\",\n        \"qualification\": \"Python: Basics and Application\"\n      },\n      {\n        \"institution\": \"Ulyanovsk Pedagogical College 4\",\n        \"location\": \"Russia\",\n        \"dates\": \"June 2008\",\n        \"qualification\": \"Diploma Informatics\"\n      }\n    ],\n    \"websites\": {\n      \"LinkedIn\": \"https://www.linkedin.com/in/sendhello\",\n      \"GitHub\": \"https://github.com/sendhello\"\n    },\n    \"languages\": [\n      \"English, B2\",\n      \"Russian, C2\"\n    ],\n    \"hobbies_interests\": [\n      \"Cycling\",\n      \"Tennis\",\n      \"Hiking\",\n      \"Coffee culture\"\n    ],\n    \"work_rights\": \"Onshore in Melbourne, VIC. Open to relocate within Australia (including Sydney). Requires employer sponsorship for full-time employment (TSS 482).\"\n  },\n  \"cover_letter\": \"Dear Hiring Team at Lendi Group,\\n\\nI am applying for the Software Engineer (Mid Level) role in the Policy team. I am a Melbourne-based Software Engineer (onshore) with 7+ years of experience building and running production backend systems in Python, including web APIs and event-driven services (Kafka/RabbitMQ). I am open to relocating to Sydney for a hybrid full-time role. Please note that I require employer sponsorship (TSS 482) for full-time employment in Australia.\\n\\nWhat attracted me to Lendi Group is the combination of product impact and engineering ownership within the home lending domain. I have hands-on experience in mortgage and credit decisioning workflows from my work at Balance-Platform, where I automated mortgage processes, built services for borrower income verification, and integrated ML model outputs into credit scoring flows. This background aligns well with your Policy team’s focus on broker tooling, customer assessments, credit scoring, servicing calculators, and automated condition checks.\\n\\nAcross my recent roles I have focused on designing robust, scalable services and owning them in production. At VK I delivered high-load microservices using PostgreSQL and Kafka, strengthened observability, and introduced safer delivery patterns (including A/B testing for business logic). At A2 Code I consolidated multiple synchronous services into a single asynchronous multi-cloud service, improved p95 latency and operational simplicity in Kubernetes, and implemented CI/CD pipelines to publish internal Python libraries with consistent testing and release processes.\\n\\nI work effectively in cross-functional teams and value pragmatic, shared understanding of the business and technical domain. I enjoy collaborating with Product and UX to translate requirements into clean API contracts and maintainable code, and I actively contribute to improving engineering ways of working through testing discipline, code review, and production-ready observability.\\n\\nI would welcome the opportunity to discuss how my backend engineering, event-driven systems experience, and lending-domain background can support Lendi Group’s mission to keep home loans human while scaling reliable broker and lender products.\\n\\nKind regards,\\nIvan Bazhenov\"\n}"